# SQL ASSESSMENT
Test for the Senior Data Analyst Position at Publicis Group <br />Publicis Global Delivery<br /><br />By: JD CEBALLOS SANCHEZ

## Libraries
Importing Libraries for developing a `Python-SQL` Solution

In [1]:
import pandas as pd, sqlite3

## Tables
Since the database containing the tables does not yet exist, they can be created using the following script

In [6]:
conn = sqlite3.connect('sqlAssessment.db')
cursor = conn.cursor()

employeeDetails =  '''
    CREATE TABLE employeeDetails (
    EmplId INTEGER PRIMARY KEY,
    FullName TEXT,
    ManagerId INTEGER,
    DateOfJoining DATE
    )
    '''

employeeSalary =  '''
    CREATE TABLE employeeSalary (
    EmplId INTEGER PRIMARY KEY,
    Project TEXT,
    Salary INTEGER
    )
    '''

cursor.execute(employeeDetails)
cursor.execute(employeeSalary)

conn.commit()
conn.close()

In [9]:
conn = sqlite3.connect('sqlAssessment.db')
cursor = conn.cursor()

In [13]:
values_employeeDetails = '''
    INSERT INTO employeeDetails (EmplId, FullName, ManagerId, DateOfJoining) VALUES
    (121, 'John Snow', 321, '01/31/2014'),
    (321, 'Walter White', 986, '01/30/2015'),
    (421, 'Kuldeep', 876, '27/11/2016')
'''

values_employeeSalary = '''
    INSERT INTO employeeSalary (EmplId, Project, Salary) VALUES
    (121, 'P1', 8000),
    (321, 'P2', 1000),
    (421, 'P1', 12000)
'''

cursor.execute(values_employeeDetails)
cursor.execute(values_employeeSalary)

conn.commit()
conn.close()

## Retrieving data

In [42]:
conn = sqlite3.connect('sqlAssessment.db')
cursor = conn.cursor()

In [45]:
#testing
query_test1 = 'SELECT * FROM employeeDetails'
cursor.execute(query_test1)
cursor.fetchall()

[(121, 'John Snow', 321, '01/31/2014'),
 (321, 'Walter White', 986, '01/30/2015'),
 (421, 'Kuldeep', 876, '27/11/2016')]

In [46]:
#testing
query_test2 = 'SELECT * FROM employeeSalary'
cursor.execute(query_test2)
cursor.fetchall()

[(121, 'P1', 8000), (321, 'P2', 1000), (421, 'P1', 12000)]

### 1. Write a SQL query to fetch the count of employees working in project ‘P1’:

In [77]:
count_of_employees_p1 = ''' 
               SELECT COUNT(employeeDetails.EmplId) as count_of_employees_p1
               FROM employeeDetails 
               INNER JOIN employeeSalary
               ON employeeSalary.EmplId = employeeDetails.EmplId
               WHERE employeeSalary.Project = 'P1'
               '''
cursor.execute(count_of_employees_p1)
count_of_employees_p1_result = cursor.fetchone()

print(count_of_employees_p1_result)

(2,)

### 2. Write a SQL query to fetch project-wise count of employees sorted by project’s count in descending order:

In [78]:
count_of_employees_pwise = ''' 
               SELECT Project, COUNT(DISTINCT employeeDetails.EmplId) as count_of_employees_pwise
               FROM employeeDetails
               INNER JOIN employeeSalary
               ON employeeSalary.EmplId = employeeDetails.EmplId
               GROUP BY 1
               '''


cursor.execute(count_of_employees_pwise)
count_of_employees_pwise_result = cursor.fetchall()

print(count_of_employees_pwise_result)

[('P1', 2), ('P2', 1)]

### 3. Write a SQL query to fetch employee names having a salary greater than or equal to 5000 and less than or equal 10000:

In [90]:
employees_salary_5000_10000 = ''' 
               SELECT employeeDetails.FullName, employeeSalary.Salary
               FROM employeeDetails
               INNER JOIN employeeSalary
               ON employeeSalary.EmplId = employeeDetails.EmplId
               WHERE employeeSalary.Salary >= '5000' AND employeeSalary.Salary<= '10000'               
               '''

cursor.execute(employees_salary_5000_10000)
employees_salary_5000_10000_result = cursor.fetchall()

print(employees_salary_5000_10000_result)

[('John Snow', 8000)]

### 4. Write a query to fetch employee names and salary records. Return employee details even if the salary record is not present for the employee:

In [106]:
employees_names_salaries = ''' 
               SELECT *
               FROM employeeDetails
               INNER JOIN employeeSalary
               ON employeeSalary.EmplId = employeeDetails.EmplId            
               '''

cursor.execute(employees_names_salaries)
employees_names_salaries_result = cursor.fetchall()

df = pd.DataFrame(employees_names_salaries_result, columns = ['EmplId', 'FullName', 'ManagerId', 'DateOfJoining', 'EmplId', 'Project', 'Salary'])
df

   EmplId      FullName  ManagerId DateOfJoining  EmplId Project  Salary
0     121     John Snow        321    01/31/2014     121      P1    8000
1     321  Walter White        986    01/30/2015     321      P2    1000
2     421       Kuldeep        876    27/11/2016     421      P1   12000

### 5. Write a SQL query to create a new table with data and structure copied from another table:

In [126]:
conn = sqlite3.connect('sqlAssessment.db')
cursor = conn.cursor()

employeeDetails_copy = '''
    CREATE TABLE IF NOT EXISTS employeeDetails_copy AS
    SELECT *
    FROM employeeDetails
    '''

cursor.execute(employeeDetails_copy)

conn.commit()
conn.close()

In [136]:
conn = sqlite3.connect('sqlAssessment.db')
cursor = conn.cursor()

#testing
query_test3 = 'SELECT * FROM employeeDetails_copy'
cursor.execute(query_test1)
cursor.fetchall()

[(121, 'John Snow', 321, '01/31/2014'),
 (321, 'Walter White', 986, '01/30/2015'),
 (421, 'Kuldeep', 876, '27/11/2016')]

### 6. Write a SQL query to fetch all the Employees details from EmployeeDetails table who joined in the Year 2016:

In [160]:
employees_detailes_joined_2016 = ''' 
               SELECT *
               FROM employeeDetails
               INNER JOIN employeeSalary
               ON employeeSalary.EmplId = employeeDetails.EmplId
               WHERE substr(employeeDetails.DateOfJoining, 7, 10) = '2016'
               '''

cursor.execute(employees_detailes_joined_2016)
employees_detailes_joined_2016_result = cursor.fetchall()

df = pd.DataFrame(employees_detailes_joined_2016_result, columns = ['EmplId', 'FullName', 'ManagerId', 'DateOfJoining', 'EmplId', 'Project', 'Salary'])
df

   EmplId FullName  ManagerId DateOfJoining  EmplId Project  Salary
0     421  Kuldeep        876    27/11/2016     421      P1   12000

#### Notes for 6.

When creating the tables for handling dates, I initially faced challenges due to the lack of a dedicated `DATE` type in `SQLite`. I spent a considerable amount of time trying to filter records for the year '2016'. Fortunately, the small size of the database, consisting of only two tables, allowed me to manually verify the results.
I eventually realized that I needed to use the `substr` function instead of `strftime` for date filtering. The underlying issue stemmed from using '/' instead of '-' as date separators when the tables were created. While both approaches can work, using '-' is more standardized and professional.